softrider70/autofrontcam/sdkconfig.defaults
# AI-Thinker ESP32-CAM (ESP32-D0WD + OV2640 + 4MB PSRAM)

CONFIG_IDF_TARGET="esp32"

# Dual-Core
CONFIG_FREERTOS_UNICORE=n

# PSRAM (4MB SPI-RAM auf ESP32-CAM) - wichtig fuer JPEG-Puffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# CPU Takt
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 4MB (aus Chip ausgelesen: ESP32-D0WD-V3, 4MB)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Eigene Partitionstabelle (OTA-Layout, 4MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console: UART (Standard-USB-TTL CH340 auf COM4)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Watchdogs deaktivieren (Kamera + Stream sind zeitkritisch)
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT=n
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_INT_WDT_INIT=n
CONFIG_ESP_WDT_INIT=n

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048

# HTTP server (OTA-WebUI + Stream)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# OTA
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# Rollback-Schutz: springt bei fehlerhaftem/abstuerzendem Update eigenstaendig
# auf die letzte stabile Partition zurueck (PENDING_VERIFY + mark_app_valid)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=4

# LWIP
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# mDNS
CONFIG_MDNS_ENABLE_NETWORKING=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Compiler-Optimierung: -Os (Groessenoptimierung) - verhindert IRAM-Ueberlauf
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_SIZE=y
